package lesson19;

public class consp {
//доп подсказка, если возникает outofmemoryexort, нужно увеличить количество хип сайз, либо докупить память
//memorydump, вещь которая нужна для анализа информации до падения  outofmemoryexort;
    //можно еще начать искать datamemoryleak после проверки memorydump
    //класс object и ООП -вопросы на собесе
    //иногда спрашивают про гид
    //иногда просят написать код
    //книги: взламываем код интервью
    //в некоторых ситуациях лучше писать код в лоб, без всяких проверок и тд
    //дополнительно можно изучить sql
    //sql- язык запросов в базе данных
    //springgood то что нужно на джава
    //groovy junit используется в некоторых ситуациях


}
